---
kind: property
id: P:Autodesk.Revit.DB.Architecture.PostPattern.EndPost
source: html/644d5e7c-1e19-a1e6-d306-7bcd6bc7a2fc.htm
---
# Autodesk.Revit.DB.Architecture.PostPattern.EndPost Property

Accesses the object containing properties related to the end post.

## Syntax (C#)
```csharp
public BalusterInfo EndPost { get; }
```